demo-pickup-request.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:est="http://estespickup.base.ws.provider.soapws.pickupRequest">
   <soapenv:Header/>
   <soapenv:Body>
      <est:createPickupRequestWS>
        <pickupRequestInput>
            <!--Optional:-->
            <requestNumber>?</requestNumber>
            <shipper>
               <shipperName>?</shipperName>
               <!--Optional:-->
               <accountCode>?</accountCode>
               <!--Optional:-->
               <shipperAddress>
                  <!--Optional:-->
                  <addressInfo>
                     <addressLine1>?</addressLine1>
                     <!--Optional:-->
                     <addressLine2>?</addressLine2>
                     <city>?</city>
                     <stateProvince>?</stateProvince>
                     <postalCode>?</postalCode>
                     <!--Optional:-->
                     <postalCode4>?</postalCode4>
                     <countryAbbrev>?</countryAbbrev>
                  </addressInfo>
               </shipperAddress>
               <!--Optional:-->
               <shipperContacts>
                  <!--1 or more repetitions:-->
                  <shipperContact>
                     <!--Optional:-->
                     <id>?</id>
                     <!--Optional:-->
                     <operation>
                        <operationType>?</operationType>
                     </operation>
                     <!--Optional:-->
                     <contactInfo>
                        <name>
                           <!--Optional:-->
                           <firstName>?</firstName>
                           <!--Optional:-->
                           <middleName>?</middleName>
                           <!--Optional:-->
                           <lastName>?</lastName>
                        </name>
                        <!--Optional:-->
                        <email>?</email>
                        <phone>
                           <areaCode>?</areaCode>
                           <number>?</number>
                           <!--Optional:-->
                           <extension>?</extension>
                        </phone>
                        <!--Optional:-->
                        <fax>
                           <areaCode>?</areaCode>
                           <number>?</number>
                        </fax>
                        <!--Optional:-->
                        <receiveNotifications>?</receiveNotifications>
                        <!--Optional:-->
                        <notificationMethod>?</notificationMethod>
                     </contactInfo>
                  </shipperContact>
               </shipperContacts>
            </shipper>
            <!--Optional:-->
            <requestAction>?</requestAction>
            <!--Optional:-->
            <paymentTerms>?</paymentTerms>
            <pickupDate>?</pickupDate>
            <!--Optional:-->
            <pickupStartTime>?</pickupStartTime>
            <!--Optional:-->
            <pickupEndTime>?</pickupEndTime>
            <!--Optional:-->
            <totalPieces>?</totalPieces>
            <!--Optional:-->
            <totalWeight>?</totalWeight>
            <!--Optional:-->
            <totalHandlingUnits>?</totalHandlingUnits>
            <!--Optional:-->
            <hazmatFlag>?</hazmatFlag>
            <!--Optional:-->
            <expeditedCode>?</expeditedCode>
            <!--Optional:-->
            <whoRequested>?</whoRequested>
            <!--Optional:-->
            <trailer>
               <!--Optional:-->
               <trailerInfo>
                  <id>?</id>
                  <!--Optional:-->
                  <length>?</length>
                  <!--Optional:-->
                  <type>?</type>
               </trailerInfo>
            </trailer>
            <!--Optional:-->
            <referenceNumbers>
               <!--1 or more repetitions:-->
               <referenceNumber>
                  <!--Optional:-->
                  <id>?</id>
                  <!--Optional:-->
                  <operation>
                     <operationType>?</operationType>
                  </operation>
                  <!--Optional:-->
                  <referenceInfo>
                     <type>?</type>
                     <value>?</value>
                     <required>?</required>
                     <!--Optional:-->
                     <totalPieces>?</totalPieces>
                     <!--Optional:-->
                     <totalWeight>?</totalWeight>
                  </referenceInfo>
               </referenceNumber>
            </referenceNumbers>
            <!--Optional:-->
            <commodities>
               <!--1 or more repetitions:-->
               <commodity>
                  <!--Optional:-->
                  <id>?</id>
                  <!--Optional:-->
                  <operation>
                     <operationType>?</operationType>
                  </operation>
                  <!--Optional:-->
                  <commodityInfo>
                     <!--Optional:-->
                     <code>?</code>
                     <!--Optional:-->
                     <packageCode>?</packageCode>
                     <description>?</description>
                     <!--Optional:-->
                     <hazmat>
                        <!--Optional:-->
                        <hazmatCode>?</hazmatCode>
                        <!--Optional:-->
                        <hazmatFlag>?</hazmatFlag>
                     </hazmat>
                     <!--Optional:-->
                     <pieces>?</pieces>
                     <!--Optional:-->
                     <weight>?</weight>
                     <!--Optional:-->
                     <nmfcNumber>?</nmfcNumber>
                     <!--Optional:-->
                     <nmfcSubNumber>?</nmfcSubNumber>
                  </commodityInfo>
               </commodity>
            </commodities>
            <!--Optional:-->
            <comments>
               <!--1 or more repetitions:-->
               <comment>
                  <!--Optional:-->
                  <id>?</id>
                  <!--Optional:-->
                  <operation>
                     <operationType>?</operationType>
                  </operation>
                  <!--Optional:-->
                  <commentInfo>
                     <type>?</type>
                     <commentText>?</commentText>
                  </commentInfo>
               </comment>
            </comments>
            <!--Optional:-->
            <addresses>
               <!--1 or more repetitions:-->
               <address>
                  <!--Optional:-->
                  <id>?</id>
                  <!--Optional:-->
                  <operation>
                     <operationType>?</operationType>
                  </operation>
                  <!--Optional:-->
                  <addressInfo>
                     <addressType>?</addressType>
                     <addressLine1>?</addressLine1>
                     <!--Optional:-->
                     <addressLine2>?</addressLine2>
                     <city>?</city>
                     <stateProvince>?</stateProvince>
                     <postalCode>?</postalCode>
                     <!--Optional:-->
                     <postalCode4>?</postalCode4>
                     <countryAbbrev>?</countryAbbrev>
                  </addressInfo>
               </address>
            </addresses>
            <!--Optional:-->
            <contacts>
               <!--1 or more repetitions:-->
               <contact>
                  <!--Optional:-->
                  <id>?</id>
                  <!--Optional:-->
                  <operation>
                     <operationType>?</operationType>
                  </operation>
                  <!--Optional:-->
                  <contactInfo>
                     <contactType>?</contactType>
                     <name>
                        <!--Optional:-->
                        <firstName>?</firstName>
                        <!--Optional:-->
                        <middleName>?</middleName>
                        <!--Optional:-->
                        <lastName>?</lastName>
                     </name>
                     <!--Optional:-->
                     <email>?</email>
                     <phone>
                        <areaCode>?</areaCode>
                        <number>?</number>
                        <!--Optional:-->
                        <extension>?</extension>
                     </phone>
                     <!--Optional:-->
                     <fax>
                        <areaCode>?</areaCode>
                        <number>?</number>
                     </fax>
                     <!--Optional:-->
                     <receiveNotifications>?</receiveNotifications>
                     <!--Optional:-->
                     <notificationMethod>?</notificationMethod>
                  </contactInfo>
               </contact>
            </contacts>
            <!--Optional:-->
            <notifications>
               <!--1 or more repetitions:-->
               <notification>
                  <!--Optional:-->
                  <id>?</id>
                  <!--Optional:-->
                  <operation>
                     <operationType>?</operationType>
                  </operation>
                  <!--Optional:-->
                  <notificationInfo>
                     <type>?</type>
                  </notificationInfo>
               </notification>
            </notifications>
         </pickupRequestInput>
      </est:createPickupRequestWS>
   </soapenv:Body>
</soapenv:Envelope>
			    